wty2019wty/esp32c3-ir-web-ESP32-C3/sdkconfig.defaults
# ESP32-S3: 4MB flash
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# 1kHz tick for snappier timing
CONFIG_FREERTOS_HZ=1000

# Custom partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# NVS encryption: HMAC scheme derives the NVS keys from an eFuse key.
# The eFuse key (KEY4) is generated and burned automatically on first boot
# with this configuration - this is irreversible.
CONFIG_NVS_ENCRYPTION=y
CONFIG_NVS_SEC_KEY_PROTECT_USING_HMAC=y
# ！！！！！！！！！！！！！！！！！！！！
CONFIG_NVS_SEC_HMAC_EFUSE_KEY_ID=4
# ！！！！！！！！！！！！！！！！！！！！

# WebSocket server (status / frame push to replace polling)
CONFIG_HTTPD_WS_SUPPORT=y

# IR capture: up to 1024 alternating segments per frame (RMT RX ping-pong
# accumulates long frames in RAM). History depth scaled down to keep the
# static RAM budget sane (each slot = frame header + 1024 x 4 bytes).
CONFIG_IR_TOOL_MAX_RX_SEGS=1024
CONFIG_IR_TOOL_HISTORY_DEPTH=8

# MQTT: compile in both protocol implementations so the protocol version can be
# selected at runtime from the Web settings page (3.1.1 default / 5.0).
CONFIG_MQTT_PROTOCOL_311=y
CONFIG_MQTT_PROTOCOL_5=y

# MQTT transports: plain TCP, TLS, and WebSocket (client side, outbound).
# MQTT-over-WS is a client connection to the broker and is fully independent
# from the built-in HTTP WebSocket server used by the web UI (/api/ws).
CONFIG_WS_TRANSPORT=y
CONFIG_MQTT_TRANSPORT_WEBSOCKET=y
CONFIG_MQTT_TRANSPORT_WEBSOCKET_SECURE=y

# TLS: when no CA/bundle is attached, esp-tls falls back to skipping server
# certificate verification instead of failing the handshake. The MQTT client
# defaults to verifying against the built-in certificate bundle; "skip" mode
# (selectable in the Web settings) relies on this fallback.
CONFIG_ESP_TLS_SKIP_SERVER_CERT_VERIFY=y

CONFIG_PM_ENABLE=y
